In [1]:
import pandas as pd

# Переименование столбцов DataFrame

In [2]:
# создаем простой датафрейм, в именах колонок которого есть пробелы

df = pd.DataFrame({'col one':[100, 200], 'col two':[300, 400]})
df

   col one  col two
0      100      300
1      200      400

In [3]:
df.col one

SyntaxError: invalid syntax (3268285381.py, line 1)

## Метод rename

In [4]:
# df = df.rename({'col one':'col_one', 'col two':'col_two'}, axis=1)

df = df.rename({'col one':'col_one', 'col two':'col_two'}, axis='columns')
df

   col_one  col_two
0      100      300
1      200      400

In [5]:
df.col_one

0    100
1    200
Name: col_one, dtype: int64

## Атрибут columns

In [6]:
df2 = pd.DataFrame({'col one':[100, 200], 'col two':[300, 400]})

In [7]:
# можно перезаписать атрибут columns в DataFrame

df2.columns = ['col_one', 'col_two']
df2

   col_one  col_two
0      100      300
1      200      400

## columns.str.replace

In [8]:
df3 = pd.DataFrame({'col one':[100, 200], 'col two':[300, 400]})

In [9]:
# можно использовать строковый метод str.replace()

df3.columns = df3.columns.str.replace(' ', '_')
df3

   col_one  col_two
0      100      300
1      200      400

## add_prefix() или add_suffix()

In [10]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [11]:
df

   col_one  col_two
0      100      300
1      200      400

In [12]:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

## Изменение имен столбцов с помощью skimpy

### https://aeturrell.github.io/skimpy/

### pip install skimpy

In [13]:
from skimpy import clean_columns

In [14]:
columns = ['_Customer__name',
           'customer_génder',
           'customer age',
           'billingAddress',
           'delivery** address  ',
           'item(Description)',
           'quantity/Volume',
           'total.price']
messy_df = pd.DataFrame(data = [], columns=columns, index=[0])
messy_df

,_Customer__name,customer_génder,customer age,billingAddress,delivery** address,item(Description),quantity/Volume,total.price
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 1. Snake Case

### Стиль Snake Case заменяет пробелы и разделители символов подчеркиванием и преобразует все символы в нижний регистр.

In [15]:
clean_df1 = clean_columns(messy_df)
clean_df1

,customer_name,customer_gender,customer_age,billing_address,delivery_address,item_description,quantity_volume,total_price
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 2. Kebab Case

### Стиль kebab case аналогичен snake, за исключением того, что вместо подчеркивания используется разделитель тире.

In [16]:
clean_df2 = clean_columns(messy_df, case = 'kebab')
clean_df2

,customer-name,customer-gender,customer-age,billing-address,delivery-address,item-description,quantity-volume,total-price
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 3. Camel Case

### Cтиль Camel case использует символы верхнего регистра в качестве разделителя, а первый символ каждой строки находится в нижнем регистре.

In [17]:
clean_df3 = clean_columns(messy_df, case = 'camel')
clean_df3

,customerName,customerGender,customerAge,billingAddress,deliveryAddress,itemDescription,quantityVolume,totalPrice
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 4. Pascal Case

### Стиль pascal подобен  Camel Case, за исключением того, что первый символ каждой строки находится в верхнем регистре.

In [18]:
clean_df4 = clean_columns(messy_df, case = 'pascal')
clean_df4

,CustomerName,CustomerGender,CustomerAge,BillingAddress,DeliveryAddress,ItemDescription,QuantityVolume,TotalPrice
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### 5. Constant Case

### Стиль constant case использует разделитель подчеркивания и изменяет все символы на верхний регистр.

In [19]:
clean_df5 = clean_columns(messy_df, case = 'const')
clean_df5

,CUSTOMER_NAME,CUSTOMER_GENDER,CUSTOMER_AGE,BILLING_ADDRESS,DELIVERY_ADDRESS,ITEM_DESCRIPTION,QUANTITY_VOLUME,TOTAL_PRICE
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Замена названия с помощью clean_columns()

In [20]:
# сокращаем Address до Addr и Description до Desc

clean_df6 = clean_columns(messy_df, case = 'pascal', replace = {'Address':'Addr', 'Description':'Desc'})
clean_df6

,CustomerName,CustomerGender,CustomerAge,BillingAddr,DeliveryAddr,ItemDesc,QuantityVolume,TotalPrice
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN